export { provinceData, cityData };

const provinceData: string[] = [
  "乌鲁木齐",
  "克拉玛依",
  "吐鲁番地区",
  "哈密地区",
  "和田地区",
  "阿克苏地区",
  "喀什地区",
  "克孜勒苏柯尔克孜自治州",
  "巴音郭楞蒙古自治州",
  "昌吉回族自治州",
  "博尔塔拉蒙古自治州",
  "石河子",
  "阿拉尔",
  "图木舒克",
  "五家渠",
  "伊犁哈萨克自治州",
  "其他"
];

const cityData = {
  乌鲁木齐: [
    "天山区",
    "沙依巴克区",
    "新市区",
    "水磨沟区",
    "头屯河区",
    "达坂城区",
    "东山区",
    "乌鲁木齐县",
    "其他"
  ],
  克拉玛依: ["克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区", "其他"],
  吐鲁番地区: ["吐鲁番市", "托克逊县", "鄯善县", "其他"],
  哈密地区: ["哈密市", "伊吾县", "巴里坤哈萨克自治县", "其他"],
  和田地区: [
    "和田市",
    "和田县",
    "洛浦县",
    "民丰县",
    "皮山县",
    "策勒县",
    "于田县",
    "墨玉县",
    "其他"
  ],
  阿克苏地区: [
    "阿克苏市",
    "温宿县",
    "沙雅县",
    "拜城县",
    "阿瓦提县",
    "库车县",
    "柯坪县",
    "新和县",
    "乌什县",
    "其他"
  ],
  喀什地区: [
    "喀什市",
    "巴楚县",
    "泽普县",
    "伽师县",
    "叶城县",
    "岳普湖县",
    "疏勒县",
    "麦盖提县",
    "英吉沙县",
    "莎车县",
    "疏附县",
    "塔什库尔干塔吉克自治县",
    "其他"
  ],
  克孜勒苏柯尔克孜自治州: [
    "阿图什市",
    "阿合奇县",
    "乌恰县",
    "阿克陶县",
    "其他"
  ],
  巴音郭楞蒙古自治州: [
    "库尔勒市",
    "和静县",
    "尉犁县",
    "和硕县",
    "且末县",
    "博湖县",
    "轮台县",
    "若羌县",
    "焉耆回族自治县",
    "其他"
  ],
  昌吉回族自治州: [
    "昌吉市",
    "阜康市",
    "奇台县",
    "玛纳斯县",
    "吉木萨尔县",
    "呼图壁县",
    "木垒哈萨克自治县",
    "米泉市",
    "其他"
  ],
  博尔塔拉蒙古自治州: ["博乐市", "精河县", "温泉县", "其他"],
  石河子: ["石河子"],
  阿拉尔: ["阿拉尔"],
  图木舒克: ["图木舒克"],
  五家渠: ["五家渠"],
  伊犁哈萨克自治州: [
    "伊宁市",
    "奎屯市",
    "伊宁县",
    "特克斯县",
    "尼勒克县",
    "昭苏县",
    "新源县",
    "霍城县",
    "巩留县",
    "察布查尔锡伯自治县",
    "塔城地区",
    "阿勒泰地区",
    "其他"
  ],
  其他: ["其他"]
};
